dh-04/Maxim32550/03BFII-41/02Code/freeRTOS/system/src/MAX32550-driver/mml_trng.c
/*
 * @file mml_trng.c MML TRNG Driver C File
 *
 ******************************************************************************
 * Copyright (C) 2016-2018 Maxim Integrated Products, Inc., All rights Reserved.
 *
 * This software is protected by copyright laws of the United States and
 * of foreign countries. This material may also be protected by patent laws
 * and technology transfer regulations of the United States and of foreign
 * countries. This software is furnished under a license agreement and/or a
 * nondisclosure agreement and may only be used or reproduced in accordance
 * with the terms of those agreements. Dissemination of this information to
 * any party or parties not specified in the license agreement and/or
 * nondisclosure agreement is expressly prohibited.
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 ******************************************************************************
 */

#include <MAX325xx.h>

#ifdef _MML_TRNG_H_

#include <errors.h>


int mml_trng_init(void) {
	/* Remove interrupt */
	TRNG->CN &= ~TRNG_CN_RNG_IE_Msk;
	/* Clear any pending information */
	TRNG->CN &= ~TRNG_CN_RNG_ISC_Msk;
	return NO_ERROR;
}

int mml_trng_read_trng_data(unsigned int *data_reg) {
	if (!(TRNG->CN & TRNG_CN_RNG_IS_Msk))
		return TRNG_ERROR_READ_NOT_READY;
	else {
		*data_reg = TRNG->DATA;
	}
	return NO_ERROR;
}

int mml_trng_configure_interrupt(TRNG_CN_RNG_IE_Type config) {

	if (config == TRNG_CN_RNG_IE_enable) {
		TRNG->CN |= TRNG_CN_RNG_IE_Msk;
	} else if (config == TRNG_CN_RNG_IE_disable) {
		TRNG->CN &= ~(TRNG_CN_RNG_IE_Msk);
	} else {
		return COMMON_ERR_INVAL;
	}
	return NO_ERROR;
}

uint32_t mml_trng_read_cn(void) {
	return TRNG->CN;
}

void mml_trng_initiate_aes_key_generation(void) {
	TRNG->CN |= TRNG_CN_AESKG_Msk;
}

const char * mml_trng_get_version( void )
{
    return MML_TRNG_VERSION_STRING;
}

#endif //_MML_TRNG_H_

/******************************************************************************/
/* EOF */
